sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      LPC23XXSim.c
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2013
    *********************************************************************
    16.08.2009 Add key scanning support                                  {1}
    16.08.2009 Add port refresh flag                                     {2}
    08.10.2009 GPIO quantity made chip dependent                         {3}
    19.10.2009 Add fnInitInternalRTC() and simulate RTC                  {4}
    19.10.2009 Add LPC2101/2/3-rev.A initialisation                      {5}
    02.11.2009 Use fast IO with LPC2104/5/6 since new revisions have fast ports {6}
    03.11.2009 Add save and retrieval of battery backed up data          {7}
    07.11.2009 Remove P0.31 restriction for LPC2101/2/3 after tests show that it can be used as input {8}
    07.11.2009 Correct Timer simulation to count over longer delays      {9}
    08.11.2009 Adapt the LPC21XX vectored interrupt source operation to use slots {10}
    29.01.2010 Accept input changes on EXINT0..3 when their DDR is as output {11}
    27.02.2010 Add LPC2148                                               {12}
    11.03.2010 Correct interrupt vector slot number for LPC21xx UART1    {13}
    13.03.2010 Add USB device                                            {14}
    11.08.2010 Add ADC                                                   {15}
    14.02.2011 Increment timers when no clear on match and respect prescaler {16}
    10.10.2013 Add EMAC CRC to rx frame length                           {17}

*/  
                          

/* =================================================================== */
/*                           include files                             */
/* =================================================================== */

#include "config.h"

#if defined _LPC23XX && !defined _LPC17XX

/**************************************************************************************************/
/********************************* NXP LPC23XX ****************************************************/
/**************************************************************************************************/

// A copy of the LPC23XX peripheral registers for simulation purposes
//
extern LPC23XX_PERIPH  ucLPC23xx = {0};

static unsigned long ulPort_in_0, ulPort_in_1, ulPort_in_2, ulPort_in_3, ulPort_in_4;

static unsigned char ucPortFunctions[PORTS_AVAILABLE][PORT_WIDTH] = { 0 };

static int iFlagRefresh = 0;                                             // {2}


#ifdef USB_INTERFACE                                                     // {14}
    static unsigned long ulEndpointInt = 0;    
    static int iRxDataBank[NUMBER_OF_USB_ENDPOINTS] = {0};
    static unsigned long ulTxDataBank[NUMBER_OF_USB_ENDPOINTS] = {0};
    static int iTxDataToggle[NUMBER_OF_USB_ENDPOINTS] = {0};
    static unsigned char ucUSB_address = DEV_EN;                         // USB device address defaults to 0x00 and enabled after reset
#endif

// Initialisation of all non-zero registers in the device
//
static void fnSetDevice(unsigned long *port_inits)
{
    extern void fnEnterHW_table(void *hw_table);

    VICSWPriorityMask = 0xffff;

    VICVectPriority0  = 0xf;
    VICVectPriority1  = 0xf;
    VICVectPriority2  = 0xf;
    VICVectPriority3  = 0xf;
    VICVectPriority4  = 0xf;
    VICVectPriority5  = 0xf;
    VICVectPriority6  = 0xf;
    VICVectPriority7  = 0xf;
    VICVectPriority8  = 0xf;
    VICVectPriority9  = 0xf;
    VICVectPriority10 = 0xf;
    VICVectPriority11 = 0xf;
    VICVectPriority12 = 0xf;
    VICVectPriority13 = 0xf;
    VICVectPriority14 = 0xf;
    VICVectPriority15 = 0xf;
    VICVectPriority16 = 0xf;
    VICVectPriority17 = 0xf;
    VICVectPriority18 = 0xf;
    VICVectPriority19 = 0xf;
    VICVectPriority20 = 0xf;
    VICVectPriority21 = 0xf;
    VICVectPriority22 = 0xf;
    VICVectPriority23 = 0xf;
    VICVectPriority24 = 0xf;
    VICVectPriority25 = 0xf;
    VICVectPriority26 = 0xf;
    VICVectPriority27 = 0xf;
    VICVectPriority28 = 0xf;
    VICVectPriority29 = 0xf;
    VICVectPriority30 = 0xf;
    VICVectPriority31 = 0xf;

#ifdef _LPC214X
    PCONP = (PCTIM0 | PCTIM1 | PCUART0 | PCUART1 | PCPWM0 | PCPWM1 | PCI2C0 | PCSPI | PCRTC | PCI2C1 | PCSSP0 | PCI2C2);
#else
    PCONP = (PCTIM0 | PCTIM1 | PCUART0 | PCUART1 | PCPWM0 | PCPWM1 | PCI2C0 | PCSPI | PCRTC | PCSSP1 | PCEMC | PCI2C1 | PCSSP0 | PCI2C2);
#endif
    IRCTRIM = 0xa0;

	I2C0STAT = I2C_IDLE_STATE;                                           // I2C Controller
	I2C1STAT = I2C_IDLE_STATE;
	I2C2STAT = I2C_IDLE_STATE;
	I2C0SCLH = 0x04;
	I2C1SCLH = 0x04;
	I2C2SCLH = 0x04;
	I2C0SCLL = 0x04;
	I2C1SCLL = 0x04;
	I2C2SCLL = 0x04;

	MAMTIM   = 0x07;                                                     // memory Accelerator Module

#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    FIO0PIN = ulPort_in_0 = *port_inits++;                               // set port inputs to default states
    FIO1PIN = ulPort_in_1 = *port_inits++;
    FIO2PIN = ulPort_in_2 = *port_inits++;
    FIO3PIN = ulPort_in_3 = *port_inits++;
    FIO4PIN = ulPort_in_4 = *port_inits;

    EMCControl = EMC_ENABLE;
    EMCStatus = 5;
    EMCDynamicControl = 0x006;
    EMCDynamicRP   = 0xf;
    EMCDynamicRAS  = 0xf;
    EMCDynamicSREX = 0xf;
    EMCDynamicAPR  = 0xf;
    EMCDynamicDAL  = 0xf;
    EMCDynamicWR   = 0xf;
    EMCDynamicRC   = 0x1f;
    EMCDynamicRFC  = 0x1f;
    EMCDynamicXSR  = 0x1f;
    EMCDynamicRRD  = 0xf;
    EMCDynamicMRD  = 0xf;

    EMCDynamicRasCas0 = (RAS_LATENCY_THREE_CCLK | CAS_LATENCY_THREE_CCLK);
    EMCDynamicRasCas1 = (RAS_LATENCY_THREE_CCLK | CAS_LATENCY_THREE_CCLK);
    EMCDynamicRasCas2 = (RAS_LATENCY_THREE_CCLK | CAS_LATENCY_THREE_CCLK);
    EMCDynamicRasCas3 = (RAS_LATENCY_THREE_CCLK | CAS_LATENCY_THREE_CCLK);

    EMCStaticWaitRd0   = 0x1f;
    EMCStaticWaitPage0 = 0x1f;
    EMCStaticWaitWr0   = 0x1f;
    EMCStaticWaitTurn0 = 0xf;

    EMCStaticWaitRd1   = 0x1f;
    EMCStaticWaitPage1 = 0x1f;
    EMCStaticWaitWr1   = 0x1f;
    EMCStaticWaitTurn1 = 0xf;

    EMCStaticWaitRd2   = 0x1f;
    EMCStaticWaitPage2 = 0x1f;
    EMCStaticWaitWr2   = 0x1f;
    EMCStaticWaitTurn2 = 0xf;

    EMCStaticWaitRd3   = 0x1f;
    EMCStaticWaitPage3 = 0x1f;
    EMCStaticWaitWr3   = 0x1f;
    EMCStaticWaitTurn3 = 0xf;
#else
    IO0PIN = ulPort_in_0 = *port_inits;
    #ifdef _LPC213X
    port_inits++;
    IO1PIN = ulPort_in_1 = *port_inits;
    #endif
#endif

#if defined LPC2101 || defined LPC2102 || defined LPC2103                // {5}
    RTC_PWRCTRL = (RTC_PMAIN | RTC_PSRAM | RTC_POSC);
#endif

#if defined USB_INTERFACE                                                // {14}
    USBIntSt = EN_USB_INTS;
#endif

    AD0CR = ADCR_SEL_CHAN0;                                              // {15}
    AD0INTEN = ADCR_ADGINTEN;

    WDTC = 0xff;                                                         // watchdog
    WDTV = 0xff;
    WDFEED = 0x12345678;                                                 // read only register - value used by simulator

    CLRT = 0x370f;                                                       // Ethernet Controller
    MAXF = 0x600;
    MAC1 = (SOFT_RESET);
    EMAC_MODULE_ID = OLD_MAC_MODULE_ID;

    U0IIR = U1IIR = U2IIR = U3IIR = 0x01;                                // UART
    U0LSR = U1LSR = U2LSR = U3LSR = 0x60;
    U0TER = U1TER = U2TER = U3TER = 0x80;
    U0FDR = U1FDR = U2FDR = U3FDR = 0x10;

    RSIR = POR;                                                          // set power up as reset cause

