sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
    fnEnterHW_table(ucPortFunctions);
}


unsigned char ucFLASH[SIZE_OF_FLASH];

extern void fnInitialiseDevice(void *port_inits)
{
    uMemset(ucFLASH, 0xff, sizeof(ucFLASH));                             // we start with deleted FLASH memory contents
    fnPrimeFileSystem();                                                 // the project can then set parameters or files as required
    fnSetDevice((unsigned long *)port_inits);                            // set device registers to startup condition (if not zerod)
}

extern void fnDeleteFlashSector(unsigned char *ptrSector)
{
	int i = FLASH_GRANULARITY;

	while (i--) {
		*ptrSector++ = 0xff;
	}
}


extern unsigned char *fnGetEEPROM(unsigned short usOffset);

extern unsigned char *fnGetFileSystemStart(int iMemory)
{
#if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    return (fnGetEEPROM(uFILE_START));
#elif defined (SAVE_COMPLETE_FLASH)
    return (&ucFLASH[0]);
#else
    return (&ucFLASH[uFILE_START-FLASH_START_ADDRESS]);
#endif
}


extern unsigned long fnGetFlashSize(int iMemory)
{
#if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    return (fnGetEEPROMSize());
#elif defined (SAVE_COMPLETE_FLASH)
    return (sizeof(ucFLASH));
#else
    return (FILE_SYSTEM_SIZE);
#endif
}

static int iSectorsSelected[28] = {0};

static unsigned long fnGetSector(unsigned long FlashAddress)
{
#ifdef _LPC21XX
    return (FlashAddress/FLASH_GRANULARITY_LARGE);
#else
    FlashAddress -= FLASH_START_ADDRESS;
    if (FlashAddress < FLASH_SECTOR_8_OFFSET) {                          // one of the first small sectors
        return (FlashAddress/FLASH_GRANULARITY_SMALL);
    }
    else if (FlashAddress < FLASH_SECTOR_22_OFFSET) {                    // one of the middle large sectors
        FlashAddress -= FLASH_SECTOR_8_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_LARGE) + 8);
    }
    else {                                                               // one of the last small sectors
        FlashAddress -= FLASH_SECTOR_22_OFFSET;
        return ((FlashAddress/FLASH_GRANULARITY_SMALL) + 22);
    }
#endif
}

static unsigned char *fnGetSectorAdd(unsigned long ulStartSector)
{
#ifdef _LPC21XX
    return (unsigned char *)(FLASH_START_ADDRESS + FLASH_SECTOR_0_OFFSET + (ulStartSector * FLASH_GRANULARITY_LARGE));
#else
    if (ulStartSector < 8) {                                             // one of the first small sectors
        return (unsigned char *)(FLASH_START_ADDRESS + FLASH_SECTOR_0_OFFSET + (ulStartSector * FLASH_GRANULARITY_SMALL));
    }
    else if (ulStartSector < 22) {                                       // one of the middle large sectors
        return (unsigned char *)(FLASH_START_ADDRESS + FLASH_SECTOR_8_OFFSET + ((ulStartSector - 8) * FLASH_GRANULARITY_LARGE));
    }
    else {                                                               // one of the last small sectors
        return (unsigned char *)(FLASH_START_ADDRESS + FLASH_SECTOR_22_OFFSET + ((ulStartSector - 22) * FLASH_GRANULARITY_SMALL));
    }
#endif
}

unsigned long fnGetSectorLength(unsigned long ulStartSector)
{
#ifdef _LPC21XX
    return (FLASH_GRANULARITY_LARGE);
#else
    if (ulStartSector < 8) {                                             // one of the first small sectors
        return (FLASH_GRANULARITY_SMALL);
    }
    else if (ulStartSector < 22) {                                       // one of the middle large sectors
        return (FLASH_GRANULARITY_LARGE);
    }
    else {                                                               // one of the last small sectors
        return (FLASH_GRANULARITY_SMALL);
    }
#endif
}

extern void fnSimNXPFlash(unsigned long commands[], unsigned long results[])
{
    int iStartSector;
    int iEndSector;
    switch (commands[0]) {
    case FLASH_PREPARE_SECTOR_TO_WRITE:
        iStartSector = commands[1];
        iEndSector   = commands[2];
        results[0] = INVALID_SECTOR;
        while (iStartSector <= iEndSector) {
            iSectorsSelected[iStartSector] = 1;                          // mark that the sector has been prepared for the next operation            
            iStartSector++;
            results[0] = CMD_SUCCESS;
        }
        break;
    case FLASH_COPY_RAM_TO_FLASH:
        {
            unsigned char *ptrDestination = (unsigned char *)commands[1];
            unsigned char *ptrSource      = (unsigned char *)commands[2];
            unsigned long ulBytesToWrite  = commands[3];
            unsigned long ulSector;
            if (commands[4] != (MASTER_CLOCK/1000)) {
                _EXCEPTION("Bad clock speed !!");
            }
            if ((CAST_POINTER_ARITHMETIC)ptrSource & 0x03) {
                results[0] = SRC_ADDR_ERROR;
                break;
            }
            if ((CAST_POINTER_ARITHMETIC)ptrDestination & 0x03) {
                results[0] = DST_ADDR_ERROR;
                break;
            }
            ulSector = fnGetSector((unsigned long)ptrDestination);
            if (ulSector >= 28) {
                results[0] = DST_ADDR_NOT_MAPPED;
                break;
            }
            if (iSectorsSelected[ulSector] == 0) {
                results[0] = SECTOR_NOT_PREPARED_FOR_WRITE_OPERATION;
                break;                
            }
            ptrDestination = fnGetFlashAdd(ptrDestination);
            if ((ptrDestination < ucFLASH) || (ptrDestination >= &ucFLASH[SIZE_OF_FLASH])) {
                results[0] = DST_ADDR_NOT_MAPPED;
                break;
            }
            if ((ulBytesToWrite != 256) && (ulBytesToWrite != 512) && (ulBytesToWrite != 1024) && (ulBytesToWrite != 4096)) {
                results[0] = COUNT_ERROR;
                break;
            }
            while (ulBytesToWrite >= FLASH_LINE_SIZE) {                  // program to FLASH (change only bits from 1 to 0) a 16 byte line can not change individual bits
                int iLineLength = 0;
                int iOldLineBlank = 1;
                unsigned char ucOldLine[FLASH_LINE_SIZE];
                unsigned char ucNewLine[FLASH_LINE_SIZE];
                uMemcpy(ucNewLine, ptrSource, FLASH_LINE_SIZE);          // make a copy of old and new FLASH data
                uMemcpy(ucOldLine, ptrDestination, FLASH_LINE_SIZE);
                while (iLineLength < FLASH_LINE_SIZE) {
                    if (ucOldLine[iLineLength++] != 0xff) {
                        iOldLineBlank = 0;
                    }
                }
                if (iOldLineBlank == 0) {                                // check that we only write 1 to non-blank lines
                    iLineLength = 0;
                    while (iLineLength < FLASH_LINE_SIZE) {
                        if (ucNewLine[iLineLength++] != 0xff) {
                            _EXCEPTION("Writing non '1' to a non-blank line !!");
                        }
                    }
                }
                else {
                    uMemcpy(ptrDestination, ptrSource, FLASH_LINE_SIZE); // write the FLASH line - we have checked that only one write to a line tries to change bits to '0'
                }
                ulBytesToWrite -= FLASH_LINE_SIZE;
                ptrDestination += FLASH_LINE_SIZE;
                ptrSource += FLASH_LINE_SIZE;
            }         
            uMemset(iSectorsSelected, 0, sizeof(iSectorsSelected));
            results[0] = CMD_SUCCESS;
        }
        break;
    case FLASH_ERASE_SECTORS:
        {
            unsigned long ulStartSector = commands[1];
            unsigned long ulEndSector   = commands[2];
            if (commands[3] != (MASTER_CLOCK/1000)) {
                 _EXCEPTION("Bad clock speed !!");
            }
            if (ulStartSector >= 28) {
                results[0] = INVALID_SECTOR;
                break;
            }
            while (ulStartSector <= ulEndSector) {
                if (iSectorsSelected[ulStartSector] == 0) {
                    results[0] = SECTOR_NOT_PREPARED_FOR_WRITE_OPERATION;
                    break; 
                }
                uMemset(fnGetFlashAdd(fnGetSectorAdd(ulStartSector)), 0xff, fnGetSectorLength(ulStartSector));
                ulStartSector++;
            }
            uMemset(iSectorsSelected, 0, sizeof(iSectorsSelected));
            results[0] = CMD_SUCCESS;
        }
        break;
    case FLASH_BLANK_CHECK_SECTORS:
        {
            unsigned long ulStartSector = commands[1];
            unsigned long ulEndSector   = commands[2];

            if (ulStartSector >= 28) {
                results[0] = INVALID_SECTOR;
                break;
            }
            while (ulStartSector <= ulEndSector) {
                unsigned char *PtrSectorAddress = fnGetSectorAdd(ulStartSector);
                unsigned long ulSectorSize = fnGetSectorLength(ulStartSector);
                while (ulSectorSize--) {
                    if (*PtrSectorAddress != 0xff) {
                        results[0] = SECTOR_NOT_BLANK;
                        results[1] = (unsigned long)(PtrSectorAddress - fnGetSectorAdd(ulStartSector)); // offset
                        results[2] = *(unsigned long *)((CAST_POINTER_ARITHMETIC)PtrSectorAddress & ~0x3);
                        break; 
                    }
                    PtrSectorAddress++;
                }               
                ulStartSector++;
            }
            results[0] = CMD_SUCCESS;
        }
        break;
#ifndef _LPC21XX
    case FLASH_READ_PART_ID:
        results[1] = PART_IDENTIFICATION_NUMBER;                         // part identification number
        results[0] = CMD_SUCCESS;
        break;
#endif
    case FLASH_READ_BOOT_CODE_VERSION:
        results[1] = 0x00000101;
        results[0] = CMD_SUCCESS;
        break;
    case FLASH_COMPARE:                                                  // not supported becasue we do not simulate RAM
        results[0] = CMD_SUCCESS;
        break;
    case FLASH_REVOKE_ISP:
        break;
    default:
        _EXCEPTION("Invalid IAP command !!");
        break;
    }
}

// Transform physical access address to address in simulated FLASH
//
extern unsigned char *fnGetFlashAdd(unsigned char *ucAdd)                // {2}
{
    unsigned long sim_add = (unsigned long)ucFLASH - (unsigned long)FLASH_START_ADDRESS;
    return ucAdd + sim_add;
}

