sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
extern unsigned char *fnPutFlashAdd(unsigned char *ucAdd)                //  {3}
{
    unsigned long sim_add = (unsigned long)ucFLASH - (unsigned long)START_OF_FLASH;
    return ucAdd - sim_add;
}

// Periodic tick (on timer 1) - dummy since timer simulation used now
//
extern void RealTimeInterrupt(void)
{
}

// Get the present state of a port - note that devices with Fast GPIO only simulate these
//
extern unsigned long fnGetPresentPortState(int portNr)
{
    portNr--;
    switch (portNr) {
#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    case _PORT0:
    #if defined _P0_31_RESTRICTION && (defined LPC2101 || defined LPC2102 || defined LPC2103) // {8} P0.31 is output only
        return (((FIO0DIR | 0x80000000) & FIO0SET) | (~(FIO0DIR | 0x80000000) & ulPort_in_0));// presently only GPIO mode 
    #else
        return ((FIO0DIR & FIO0SET) | (~FIO0DIR & ulPort_in_0));         // presently only GPIO mode                   
    #endif
    case _PORT1:
        return ((FIO1DIR & FIO1SET) | (~FIO1DIR & ulPort_in_1));  
    case _PORT2:
        return ((FIO2DIR & FIO2SET) | (~FIO2DIR & ulPort_in_2));  
    case _PORT3:
        return ((FIO3DIR & FIO3SET) | (~FIO3DIR & ulPort_in_3));  
    case _PORT4:
        return ((FIO4DIR & FIO4SET) | (~FIO4DIR & ulPort_in_4));
#else
    case _PORT0:
        return ((IO0DIR & IO0SET) | (~IO0DIR & ulPort_in_0));            // presently only GPIO mode 
    #ifdef _LPC213X
    case _PORT1:
    return ((IO1DIR & IO1SET) | (~IO1DIR & ulPort_in_1));                // presently only GPIO mode 
    #endif
#endif
    default:
        return 0;
    }
}

// Get the present state of a port direction - note that devices with Fast GPIO only simulate these
//
extern unsigned long fnGetPresentPortDir(int portNr)
{
    portNr--;
    switch (portNr) {
#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    case _PORT0:
    #if defined _P0_31_RESTRICTION && (defined LPC2101 || defined LPC2102 || defined LPC2103) // {8}
    return (FIO0DIR | 0x80000000);                                       // P0.31 is output only
    #else
    return (FIO0DIR);
    #endif
    case _PORT1:
    return (FIO1DIR);
    case _PORT2:
    return (FIO2DIR);
    case _PORT3:
    return (FIO3DIR);
    case _PORT4:
    return (FIO4DIR);
#else
    case _PORT0:
    return (IO0DIR);
#endif
    default:
        return 0;
    }
}

static unsigned short fnIsPer(unsigned long ucPinSelValue)
{
    unsigned long ulCheck = 0x00000003;
    unsigned short usPeripheral = 0;
    unsigned short usPeripheralBit = 0x0001;
    while (usPeripheralBit != 0) {
        if ((ucPinSelValue & ulCheck) != 0) {
            usPeripheral |= usPeripheralBit;                             // port has a peripheral function
        }
        usPeripheralBit <<= 1;
        ulCheck <<= 2;
    }
    return usPeripheral;
}

extern unsigned long fnGetPresentPortPeriph(int portNr)
{
    unsigned long ulPeripherals = 0;

    portNr--;
    switch (portNr) {
    case _PORT0:
        ulPeripherals = fnIsPer(PINSEL1);
        ulPeripherals <<= 16;
        ulPeripherals |= fnIsPer(PINSEL0);
        return (ulPeripherals);
    case _PORT1:
        ulPeripherals = fnIsPer(PINSEL3);
        ulPeripherals <<= 16;
        ulPeripherals |= fnIsPer(PINSEL2);
        return (ulPeripherals);
    case _PORT2:
        ulPeripherals = fnIsPer(PINSEL5);
        ulPeripherals <<= 16;
        ulPeripherals |= fnIsPer(PINSEL4);
        return (ulPeripherals);
    case _PORT3:
        ulPeripherals = fnIsPer(PINSEL7);
        ulPeripherals <<= 16;
        ulPeripherals |= fnIsPer(PINSEL6);
        return (ulPeripherals);
    case _PORT4:
        ulPeripherals = fnIsPer(PINSEL9);
        ulPeripherals <<= 16;
        ulPeripherals |= fnIsPer(PINSEL8);
        return (ulPeripherals);
    default:
        return 0;
    }
}

#if defined LPC2478FBD208 || defined LPC2478FET208
static void fnMapLCD_pins(int iPort, int iBit, unsigned char ucFunction)
{
    switch (iPort) {
    case 0:
        if (((iBit >= 4) && (iBit <= 9)) && (ucFunction == 0x01)) {
            ucPortFunctions[iPort][iBit] = 4;                            // LCD function
        }
        break;
    case 1:
        if (((iBit >= 20) && (iBit <= 29)) && (ucFunction == 0x01)) {
            ucPortFunctions[iPort][iBit] = 4;                            // LCD function
        }
        break;
    case 2:
        if (((iBit >= 11) && (iBit <= 13)) && (ucFunction == 0x01)) {
            ucPortFunctions[iPort][iBit] = 4;                            // LCD function
        }
        else if ((iBit <= 9) && (ucFunction == 0x03)) {
            ucPortFunctions[iPort][iBit] = 4;                            // LCD function
        }
        break;
    case 3:
        break;
    case 4:
        if (((iBit >= 28) && (iBit <= 29)) && (ucFunction == 0x02)) {
            ucPortFunctions[iPort][iBit] = 4;                            // LCD function
        }
        break;
    }
}
#endif

static void fnUpdatePeripheralFunction(int iPort, unsigned long ulPortFunction)
{
    int i = 0;
    unsigned long ulPortBit = 0x00000001;
    unsigned long *ptrPinSel = (unsigned long *)PIN_CONNECT_BLOCK;
    unsigned short usShift = 0;

    ptrPinSel += (2*iPort);

    while (ulPortFunction != 0) {
        if (ulPortFunction & ulPortBit) {
            unsigned char ucFunction = (unsigned char)(0x03 & (*ptrPinSel >> usShift));
            ucPortFunctions[iPort][i] = ucFunction;
#if defined LPC2478FBD208 || defined LPC2478FET208
            if (PINSEL11 & LCDPE) {                                      // if the LCD function is enabled map any LCD pins to their LCD use
                fnMapLCD_pins(iPort, i, ucFunction);
            }
#endif
            ulPortFunction &= ~ulPortBit;
        }
        i++;
        ulPortBit <<= 1;
        usShift += 2;
        if (usShift >= 32) {
            usShift = 0;
            ptrPinSel++;
        }
    }
}

#ifdef _LPC21XX                                                          // {10}
// Search through the vectored interrupt slots to find the entry corresponding to a particular interrupt source
//
static unsigned long fnGetVectoredIntSlot(unsigned long ulInterruptSource)
{
    unsigned long *ptrSlots = VICPRIORITY_ADD;
    int i;
    for (i = 0; i < 16; i++) {
        if ((0x1 << (*ptrSlots & 0x1f)) & ulInterruptSource) {
            return *(VICVECT_ADD + i);
        }
        ptrSlots++;
    }
    return 0;                                                            // not found
}
#endif



// See whether there has been a port change which should be displayed
//
extern int fnPortChanges(int iForce)
{
    static unsigned long ulPortDir0 = 0, ulPortDir1 = 0, ulPortDir2 = 0, ulPortDir3 = 0, ulPortDir4 = 0;
    static unsigned long ulPortVal0 = 0, ulPortVal1 = 0, ulPortVal2 = 0, ulPortVal3 = 0, ulPortVal4 = 0;
    static unsigned long ulPortFunction0 = 0, ulPortFunction1 = 0, ulPortFunction2 = 0, ulPortFunction3 = 0, ulPortFunction4 = 0;
    unsigned long ulNewValue;
    unsigned long ulNewPortPer;
    int iRtn = iFlagRefresh;
    iFlagRefresh = 0;

#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    ulNewValue = fnGetPresentPortState(_PORT0+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT0+1);
    if ((ulPortDir0 != FIO0DIR) || (ulNewValue != ulPortVal0) || (ulNewPortPer != ulPortFunction0)) {
        ulPortDir0 = FIO0DIR;
        ulPortVal0 = ulNewValue;
        ulPortFunction0 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT0, ulPortFunction0);
        iRtn |= PORT_CHANGE;
    }
    ulNewValue = fnGetPresentPortState(_PORT1+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT1+1);
    if ((ulPortDir1 != FIO1DIR) || (ulNewValue != ulPortVal1) || (ulNewPortPer != ulPortFunction1)) {
        ulPortDir1 = FIO1DIR;
        ulPortVal1 = ulNewValue;
        ulPortFunction1 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT1, ulPortFunction1);
        iRtn |= PORT_CHANGE;
    }   
    ulNewValue = fnGetPresentPortState(_PORT2+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT2+1);
    if ((ulPortDir2 != FIO2DIR) || (ulNewValue != ulPortVal2) || (ulNewPortPer != ulPortFunction2)) {
        ulPortDir2 = FIO2DIR;
        ulPortVal2 = ulNewValue;
        ulPortFunction2 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT2, ulPortFunction2);
        iRtn |= PORT_CHANGE;
    }   
    ulNewValue = fnGetPresentPortState(_PORT3+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT3+1);
    if ((ulPortDir3 != FIO3DIR) || (ulNewValue != ulPortVal3) || (ulNewPortPer != ulPortFunction3)) {
        ulPortDir3 = FIO3DIR;
        ulPortVal3 = ulNewValue;
        ulPortFunction3 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT3, ulPortFunction3);
        iRtn |= PORT_CHANGE;
    }   
    ulNewValue = fnGetPresentPortState(_PORT4+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT4+1);
    if ((ulPortDir4 != FIO4DIR) || (ulNewValue != ulPortVal4) || (ulNewPortPer != ulPortFunction4)) {
        ulPortDir4 = FIO4DIR;
        ulPortVal4 = ulNewValue;
        ulPortFunction4 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT4, ulPortFunction4);
        iRtn |= PORT_CHANGE;
    }   
#else
    ulNewValue = fnGetPresentPortState(_PORT0+1);
    ulNewPortPer = fnGetPresentPortPeriph(_PORT0+1);
    if ((ulPortDir0 != IO0DIR) || (ulNewValue != ulPortVal0) || (ulNewPortPer != ulPortFunction0)) {
        ulPortDir0 = IO0DIR;
        ulPortVal0 = ulNewValue;
        ulPortFunction0 = ulNewPortPer;
        fnUpdatePeripheralFunction(_PORT0, ulPortFunction0);
        iRtn |= PORT_CHANGE;
    }
#endif
    return iRtn;
}

