sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
// Handle port interrupts on input changes
//
static void fnPortInterrupt(int iPort, unsigned long ulChangedBit)
{
    switch (iPort) {
    case _PORT0:
        if (ulChangedBit & IO0IntEnR & ulPort_in_0) {                    // rising edge on this rising-edge enabled bit
            IO0IntStatR |= (ulChangedBit & IO0IntEnR & ulPort_in_0);     // signal that an interrupt is pending
            IOIntStatus |= P0int;
        }
        if (ulChangedBit & IO0IntEnF & ~ulPort_in_0) {                   // falling edge on this falling-edge enabled bit
            IO0IntStatF |= (ulChangedBit & IO0IntEnF & ~ulPort_in_0);    // signal that an interrupt is pending
            IOIntStatus |= P0int;
        }        
        break;
    case _PORT2:
        if (ulChangedBit & IO2IntEnR & ulPort_in_2) {                    // rising edge on this rising-edge enabled bit
            IO2IntStatR |= (ulChangedBit & IO2IntEnR & ulPort_in_2);     // signal that an interrupt is pending
            IOIntStatus |= P2int;
        }
        if (ulChangedBit & IO2IntEnF & ~ulPort_in_2) {                   // falling edge on this falling-edge enabled bit
            IO2IntStatF |= (ulChangedBit & IO2IntEnF & ~ulPort_in_2);    // signal that an interrupt is pending
            IOIntStatus |= P2int;
        }
#ifndef _LPC21XX                                                         // edge interrupts handled on LPC23XX
        if (ulChangedBit & PORT2_BIT10) {                                // handle external interrupts on EINT0
            if ((PINSEL4 & PINSEL4_P2_10_RESET) == PINSEL4_P2_10_EINT0) {// configured as EINT0 pin
                if ((ulPort_in_2 & PORT2_BIT10) && (EXTPOLAR & EXTMODE & EXTPOLAR0)) { // positive edge sensitive and change detected
                    EXTINT |= EINT0;
                }
                else if ((!(ulPort_in_2 & PORT2_BIT10)) && (EXTMODE & EXTMODE0) && (!(EXTPOLAR & EXTPOLAR0))) {// negative edge sensitive and change detected
                    EXTINT |= EINT0;
                }
            }
            if (EXTINT & EINT0) {
                if (VICIntEnable & INTERRUPT_EINT0) {                    // if the interrupt is enabled
                    void (*interrupt_call)(void);
                    interrupt_call = (void (*)(void))VICVectAddr14;
                    interrupt_call();                                    // call interrupt handler
                }
            }
        }
        if (ulChangedBit & PORT2_BIT11) {                                // handle external interrupts on EINT1
            if ((PINSEL4 & PINSEL4_P2_11_RESET) == PINSEL4_P2_11_EINT1) {// configured as EINT1 pin
                if ((ulPort_in_2 & PORT2_BIT11) && (EXTPOLAR & EXTMODE & EXTPOLAR1)) { // positive edge sensitive and change detected
                    EXTINT |= EINT1;
                }
                else if ((!(ulPort_in_2 & PORT2_BIT11)) && (EXTMODE & EXTMODE1) && (!(EXTPOLAR & EXTPOLAR1))) {// negative edge sensitive and change detected
                    EXTINT |= EINT1;
                }
            }
            if (EXTINT & EINT1) {
                if (VICIntEnable & INTERRUPT_EINT1) {                    // if the interrupt is enabled
                    void (*interrupt_call)(void);
                    interrupt_call = (void (*)(void))VICVectAddr15;
                    interrupt_call();                                    // call interrupt handler
                }
            }
        }
        if (ulChangedBit & PORT2_BIT12) {                                // handle external interrupts on EINT2
            if ((PINSEL4 & PINSEL4_P2_12_RESET) == PINSEL4_P2_12_EINT2) {// configured as EINT2 pin
                if ((ulPort_in_2 & PORT2_BIT12) && (EXTPOLAR & EXTMODE & EXTPOLAR2)) { // positive edge sensitive and change detected
                    EXTINT |= EINT2;
                }
                else if ((!(ulPort_in_2 & PORT2_BIT12)) && (EXTMODE & EXTMODE2) && (!(EXTPOLAR & EXTPOLAR2))) {// negative edge sensitive and change detected
                    EXTINT |= EINT2;
                }
            }
            if (EXTINT & EINT2) {
                if (VICIntEnable & INTERRUPT_EINT2) {                    // if the interrupt is enabled
                    void (*interrupt_call)(void);
                    interrupt_call = (void (*)(void))VICVectAddr16;
                    interrupt_call();                                    // call interrupt handler
                }
            }
        }
        if (ulChangedBit & PORT2_BIT13) {                                // handle external interrupts on EINT3
            if ((PINSEL4 & PINSEL4_P2_13_RESET) == PINSEL4_P2_13_EINT3) {// configured as EINT3 pin
                if ((ulPort_in_2 & PORT2_BIT13) && (EXTPOLAR & EXTMODE & EXTPOLAR3)) { // positive edge sensitive and change detected
                    EXTINT |= EINT3;
                }
                else if ((!(ulPort_in_2 & PORT2_BIT13)) && (EXTMODE & EXTMODE3) && (!(EXTPOLAR & EXTPOLAR3))) {// negative edge sensitive and change detected
                    EXTINT |= EINT3;
                }
            }
        }
#endif
        break;
    }
    if ( 
#ifndef _LPC21XX
        (EXTINT & EINT3) ||                                              // external interrupt 3 shares an interrupt with the GPO ports
#endif
        (IOIntStatus & (P0int | P2int))) {
        if (VICIntEnable & INTERRUPT_EINT3) {                            // if the interrupt is enabled
            void (*interrupt_call)(void);
#ifdef _LPC21XX
            interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_EINT3);
#else
            interrupt_call = (void (*)(void))VICVectAddr17;
#endif
            interrupt_call();                                            // call interrupt handler
        }
    }
}

// Simulate setting, clearing or toggling of an input pin
//
extern void fnSimulateInputChange(unsigned char ucPort, unsigned char ucPortBit, int iChange)
{
    unsigned long ulBit = (0x80000000 >> ucPortBit);
    switch (ucPort) {
#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    case _PORT0:
    #if defined _P0_31_RESTRICTION && (defined LPC2101 || defined LPC2102 || defined LPC2103) // {8}
        if (~FIO0DIR & ulBit & ~0x80000000)
    #else
        if (~FIO0DIR & ulBit)
    #endif
        {
            unsigned long ulOriginal_port_state = ulPort_in_0;
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_0 ^= ulBit;
                FIO0PIN &= ~ulBit;
                FIO0PIN |= (ulPort_in_0 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_0 |= ulBit;
                FIO0PIN |= ulBit;
            }
            else {
                ulPort_in_0 &= ~ulBit;
                FIO0PIN &= ~ulBit;
            }
            if (ulPort_in_0 != ulOriginal_port_state) {
                fnPortInterrupt(_PORT0, ulBit);
            }
        }
        break;
    case _PORT1:
        if (~FIO1DIR & ulBit) {
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_1 ^= ulBit;
                FIO1PIN &= ~ulBit;
                FIO1PIN |= (ulPort_in_1 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_1 |= ulBit;
                FIO1PIN |= ulBit;
            }
            else {
                ulPort_in_1 &= ~ulBit;
                FIO1PIN &= ~ulBit;
            }
        }
        break;
    case _PORT2:
        {
            unsigned long ulOriginal_port_state = ulPort_in_2;
            if (!(~FIO2DIR & ulBit)) {                                   // {11} accept input change if an input or an external interrupt
                if ((ulBit == PORT2_BIT10) && ((PINSEL4 & PINSEL4_P2_10_RESET) == PINSEL4_P2_10_EINT0)) {
                }
                else if ((ulBit == PORT2_BIT11) && ((PINSEL4 & PINSEL4_P2_11_RESET) == PINSEL4_P2_11_EINT1)) {
                }
                else if ((ulBit == PORT2_BIT12) && ((PINSEL4 & PINSEL4_P2_12_RESET) == PINSEL4_P2_12_EINT2)) {
                }
                else if ((ulBit == PORT2_BIT13) && ((PINSEL4 & PINSEL4_P2_13_RESET) == PINSEL4_P2_13_EINT3)) {
                }
                else {
                    break;
                }
            }
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_2 ^= ulBit;
                FIO2PIN &= ~ulBit;
                FIO2PIN |= (ulPort_in_2 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_2 |= ulBit;
                FIO2PIN |= ulBit;
            }
            else {
                ulPort_in_2 &= ~ulBit;
                FIO2PIN &= ~ulBit;
            }
            if (ulPort_in_2 != ulOriginal_port_state) {
                fnPortInterrupt(_PORT2, ulBit);
            }
        }
        break;
    case _PORT3:
        if (~FIO3DIR & ulBit) {
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_3 ^= ulBit;
                FIO3PIN &= ~ulBit;
                FIO3PIN |= (ulPort_in_3 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_3 |= ulBit;
                FIO3PIN |= ulBit;
            }
            else {
                ulPort_in_3 &= ~ulBit;
                FIO3PIN &= ~ulBit;
            }
        }
        break;
    case _PORT4:
        if (~FIO4DIR & ulBit) {
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_4 ^= ulBit;
                FIO4PIN &= ~ulBit;
                FIO4PIN |= (ulPort_in_4 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_4 |= ulBit;
                FIO4PIN |= ulBit;
            }
            else {
                ulPort_in_4 &= ~ulBit;
                FIO4PIN &= ~ulBit;
            }
        }
        break;
#else
    case _PORT0:
        if (~IO0DIR & ulBit) {
            if (iChange == TOGGLE_INPUT) {
                ulPort_in_0 ^= ulBit;
                IO0PIN &= ~ulBit;
                IO0PIN |= (ulPort_in_0 & ulBit);
            }
            else if (iChange == SET_INPUT) {
                ulPort_in_0 |= ulBit;
                IO0PIN |= ulBit;
            }
            else {
                ulPort_in_0 &= ~ulBit;
                IO0PIN &= ~ulBit;
            }
        }
        break;
#endif
    }
}

