sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
// Update ports based on present register settings
//
extern void fnSimPorts(int iThisPort)
{
    static unsigned long ulOutput0 = 0, ulOutput1 = 0, ulOutput2 = 0, ulOutput3 = 0, ulOutput4 = 0;
    unsigned long ulNewState;

#if (!defined LPC2104 && !defined LPC2105 && !defined LPC2106 && !defined _LPC213X) || !defined LPC21XX_LEGACY_PART // {6}
    ulNewState = ulOutput0 & (~(FIO0CLR & ~FIO0MASK));
    FIO0CLR = 0;
    ulNewState |= (FIO0SET & ~ulOutput0 & ~FIO0MASK);
    FIO0SET = ulOutput0 = ulNewState;
    FIO0PIN = FIO0DIR & FIO0SET | (~FIO0DIR & ulPort_in_0);
    #ifndef _LPC21XX                                                     // {3}
    ulNewState = ulOutput1 & (~(FIO1CLR & ~FIO1MASK));
    FIO1CLR = 0;
    ulNewState |= (FIO1SET & ~ulOutput1 & ~FIO1MASK);
    FIO1SET = ulOutput1 = ulNewState;
    FIO1PIN = FIO1DIR & FIO1SET | (~FIO1DIR & ulPort_in_1);

    ulNewState = ulOutput2 & (~(FIO2CLR & ~FIO2MASK));
    FIO2CLR = 0;
    ulNewState |= (FIO2SET & ~ulOutput2 & ~FIO2MASK);
    FIO2SET = ulOutput2 = ulNewState;
    FIO2PIN = FIO2DIR & FIO2SET | (~FIO2DIR & ulPort_in_2);
    FIO2CLR = 0;

    ulNewState = ulOutput3 & (~(FIO3CLR & ~FIO3MASK));
    FIO3CLR = 0;
    ulNewState |= (FIO3SET & ~ulOutput3 & ~FIO3MASK);
    FIO3SET = ulOutput3 = ulNewState;
    FIO3PIN = FIO3DIR & FIO3SET | (~FIO3DIR & ulPort_in_3);

    ulNewState = ulOutput4 & (~(FIO4CLR & ~FIO4MASK));
    FIO4CLR = 0;
    ulNewState |= (FIO4SET & ~ulOutput4 & ~FIO4MASK);
    FIO4SET = ulOutput4 = ulNewState;
    FIO4PIN = FIO4DIR & FIO4SET | (~FIO4DIR & ulPort_in_4);
    #endif
#elif defined _LPC213X
    ulNewState = ulOutput0 & (~(IO0CLR));
    IO0CLR = 0;
    ulNewState |= (IO0SET & ~ulOutput0);
    IO0SET = ulOutput0 = ulNewState;
    IO0PIN = IO0DIR & IO0SET | (~IO0DIR & ulPort_in_0);

    ulNewState = ulOutput1 & (~(IO1CLR));
    IO1CLR = 0;
    ulNewState |= (IO1SET & ~ulOutput1);
    IO1SET = ulOutput1 = ulNewState;
    IO1PIN = IO1DIR & IO1SET | (~IO1DIR & ulPort_in_1);
#else
    ulNewState = ulOutput0 & (~(IO0CLR & ~IO0MASK));
    IO0CLR = 0;
    ulNewState |= (IO0SET & ~ulOutput0 & ~IO0MASK);
    IO0SET = ulOutput0 = ulNewState;
    IO0PIN = IO0DIR & IO0SET | (~IO0DIR & ulPort_in_0);
#endif

#if CHIP_HAS_UARTS > 0 && defined RTS_0_PIN                              // RTS outputs
    if (RTS_0_PORT_DDR & RTS_0_PIN) {                                    // user defined RTS pin configured as output
        static unsigned char ucRTS0 = 1;
        if (RTS_0_PORT & RTS_0_PIN) {
            if (ucRTS0 == 0) {
                ucRTS0 = 1;
                fnConfigSimSCI(0, NEGATE_RTS_COM_0, 0);                  // negate control line
            }
        }
        else {
            if (ucRTS0 != 0) {
                ucRTS0 = 0;
                fnConfigSimSCI(0, ASSERT_RTS_COM_0, 0);                  // assert control line
            }
        }
    }
#endif
#if CHIP_HAS_UARTS > 1 && defined RTS_1_PIN                              // RTS outputs
    if (RTS_1_PORT_DDR & RTS_1_PIN) {                                    // user defined RTS pin configured as output
        static unsigned char ucRTS1 = 1;
        if (RTS_1_PORT & RTS_1_PIN) {
            if (ucRTS1 == 0) {
                ucRTS1 = 1;
                fnConfigSimSCI(1, NEGATE_RTS_COM_1, 0);                  // negate control line
            }
        }
        else {
            if (ucRTS1 != 0) {
                ucRTS1 = 0;
                fnConfigSimSCI(1, ASSERT_RTS_COM_1, 0);                  // assert control line
            }
        }
    }
#endif
#if CHIP_HAS_UARTS > 2 && defined RTS_2_PIN                              // RTS outputs
    if (RTS_2_PORT_DDR & RTS_2_PIN) {                                    // user defined RTS pin configured as output
        static unsigned char ucRTS2 = 1;
        if (RTS_2_PORT & RTS_2_PIN) {
            if (ucRTS2 == 0) {
                ucRTS2 = 1;
                fnConfigSimSCI(2, NEGATE_RTS_COM_2, 0);                  // negate control line
            }
        }
        else {
            if (ucRTS2 != 0) {
                ucRTS2 = 0;
                fnConfigSimSCI(2, ASSERT_RTS_COM_2, 0);                  // assert control line
            }
        }
    }
#endif
#if CHIP_HAS_UARTS > 3 && defined RTS_3_PIN                              // RTS outputs
    if (RTS_3_PORT_DDR & RTS_3_PIN) {                                    // user defined RTS pin configured as output
        static unsigned char ucRTS3 = 1;
        if (RTS_3_PORT & RTS_3_PIN) {
            if (ucRTS3 == 0) {
                ucRTS3 = 1;
                fnConfigSimSCI(3, NEGATE_RTS_COM_3, 0);                  // negate control line
            }
        }
        else {
            if (ucRTS3 != 0) {
                ucRTS3 = 0;
                fnConfigSimSCI(3, ASSERT_RTS_COM_3, 0);                  // assert control line
            }
        }
    }
#endif
}


// Simulate the reception of serial data by inserting bytes into the input buffer and calling interrupts
//
extern void fnSimulateSerialIn(int iPort, unsigned char *ptrDebugIn, unsigned short usLen)
{
#ifdef SERIAL_INTERFACE
    void (*interrupt_call)(void);
    switch (iPort) {
    case 0:
        if (U0FCR & FIFO_ENABLE) {
            U0IIR |= UART_FIFO_ENABLED;
        }
        else {
            return;
        }
        while (usLen--) {
            U0LSR |= UART_RDR;                                           // line status
            U0IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
            U0IIR |= UART_RDA_INT_PENDING;                               // set interrupt cause
	        U0RBR_THR = *ptrDebugIn++;                                   // put each character into the receive holding register
            if (VICIntEnable & INTERRUPT_UART0) {                        // if the interrupt is defined
    #ifdef _LPC21XX
                interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_UART0);
    #else
                interrupt_call = (void (*)(void))VICVectAddr6;
    #endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        break;
    case 1:
        if (U1FCR & FIFO_ENABLE) {
            U1IIR |= UART_FIFO_ENABLED;
        }
        else {
            return;
        }
        while (usLen--) {
            U1LSR |= UART_RDR;                                           // line status
            U1IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
            U1IIR |= UART_RDA_INT_PENDING;                               // set interrupt cause
	        U1RBR_THR = *ptrDebugIn++;                                   // put each character into the receive holding register
            if (VICIntEnable & INTERRUPT_UART1) {                        // if the interrupt is defined
    #ifdef _LPC21XX
                interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_UART1);
    #else
                interrupt_call = (void (*)(void))VICVectAddr7;
    #endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        break;
    case 2:
        if (U2FCR & FIFO_ENABLE) {
            U2IIR |= UART_FIFO_ENABLED;
        }
        else {
            return;
        }
        while (usLen--) {
            U2LSR |= UART_RDR;                                           // line status
            U2IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
            U2IIR |= UART_RDA_INT_PENDING;                               // set interrupt cause
	        U2RBR_THR = *ptrDebugIn++;                                   // put each character into the receive holding register
            if (VICIntEnable & INTERRUPT_UART2) {                        // if the interrupt is defined
                interrupt_call = (void (*)(void))VICVectAddr28;
                interrupt_call();                                        // call interrupt handler
            }
        }
        break;
    case 3:
        if (U3FCR & FIFO_ENABLE) {
            U3IIR |= UART_FIFO_ENABLED;
        }
        else {
            return;
        }
        while (usLen--) {
            U3LSR |= UART_RDR;                                           // line status
            U3IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
            U3IIR |= UART_RDA_INT_PENDING;                               // set interrupt cause
	        U3RBR_THR = *ptrDebugIn++;                                   // put each character into the receive holding register
            if (VICIntEnable & INTERRUPT_UART3) {                        // if the interrupt is defined
                interrupt_call = (void (*)(void))VICVectAddr29;
                interrupt_call();                                        // call interrupt handler
            }
        }
        break;
    }
#endif
}

// Process simulated interrupts
//
extern unsigned long fnSimInts(char *argv[])
{
#ifdef SERIAL_INTERFACE
    extern unsigned char ucTxLast[NUMBER_SERIAL];
#endif
    unsigned long ulNewActions = 0;
    int *ptrCnt;

    if ((iInts & CHANNEL_0_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART0];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_0_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#ifdef SERIAL_INTERFACE
                void (*interrupt_call)(void);
#endif
		        iInts &= ~CHANNEL_0_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx0(ucTxLast[0]);
                ulNewActions |= SEND_COM_0;
                U0LSR |= UART_THRE;                                      // line status
                U0IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
                U0IIR |= UART_THRE_INT_PENDING;                          // set interrupt cause
                if (VICIntEnable & INTERRUPT_UART0) {                    // if the interrupt is defined
    #ifdef _LPC21XX
                    interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_UART0);
    #else
                    interrupt_call = (void (*)(void))VICVectAddr6;
    #endif
                    interrupt_call();                                    // call interrupt handler
                }
#endif
            }
        }
	}

