sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
    if ((iInts & CHANNEL_1_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[1];
        if (*ptrCnt) {
            if (--(*ptrCnt) == THROUGHPUT_UART1) {
                iMasks |= CHANNEL_1_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#ifdef SERIAL_INTERFACE
                void (*interrupt_call)(void);
#endif
		        iInts &= ~CHANNEL_1_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx1(ucTxLast[1]);
                ulNewActions |= SEND_COM_1;
                U1LSR |= UART_THRE;                                      // line status
                U1IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
                U1IIR |= UART_THRE_INT_PENDING;                          // set interrupt cause
                if (VICIntEnable & INTERRUPT_UART1) {                    // if the interrupt is defined
    #ifdef _LPC21XX
                    interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_UART1); // {13}
    #else
                    interrupt_call = (void (*)(void))VICVectAddr7;
    #endif
                    interrupt_call();                                    // call interrupt handler
                }
#endif
            }
        }
	}

    if ((iInts & CHANNEL_2_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART2];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_2_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#ifdef SERIAL_INTERFACE
                void (*interrupt_call)(void);
#endif
		        iInts &= ~CHANNEL_2_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx2(ucTxLast[2]);
                ulNewActions |= SEND_COM_2;
                U2LSR |= UART_THRE;                                      // line status
                U2IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
                U2IIR |= UART_THRE_INT_PENDING;                          // set interrupt cause
                if (VICIntEnable & INTERRUPT_UART2) {                    // if the interrupt is defined
                    interrupt_call = (void (*)(void))VICVectAddr28;
                    interrupt_call();                                    // call interrupt handler
                }
#endif
            }
        }
	}

    if ((iInts & CHANNEL_3_SERIAL_INT) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_UART3];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= CHANNEL_3_SERIAL_INT;                          // enough serial interupts handled in this tick period
            }
            else {
#ifdef SERIAL_INTERFACE
                void (*interrupt_call)(void);
#endif
		        iInts &= ~CHANNEL_3_SERIAL_INT;                          // interrupt has been handled
#ifdef SERIAL_INTERFACE
	            fnLogTx3(ucTxLast[3]);
                ulNewActions |= SEND_COM_3;
                U3LSR |= UART_THRE;                                      // line status
                U3IIR &= ~(UART_NO_INT_PENDING | UART_INT_MASK);
                U3IIR |= UART_THRE_INT_PENDING;                          // set interrupt cause
                if (VICIntEnable & INTERRUPT_UART3) {                    // if the interrupt is defined
                    interrupt_call = (void (*)(void))VICVectAddr29;
                    interrupt_call();                                    // call interrupt handler
                }
#endif
            }
        }
	}

    if ((iInts & I2C_INT0) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C0];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT0;                                      // enough I2C interupts handled in this tick period
            }
            else {
		        iInts &= ~I2C_INT0;                                      // interrupt has been handled
#if defined I2C_INTERFACE
                if (I2C0STAT != I2C_IDLE_STATE) {                        // if a state generating an interrupt
                    if (VICIntEnable & INTERRUPT_I2C0) {                 // if the interrupt is defined
                        void (*interrupt_call)(void);
    #if defined _LPC21XX
                        interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_I2C0);
    #else
                        interrupt_call = (void (*)(void))VICVectAddr9;
    #endif
                        interrupt_call();                                // call interrupt handler
                    }
                }
#endif
            }
        }
	}

    if ((iInts & I2C_INT1) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C1];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT1;                                      // enough I2C interupts handled in this tick period
            }
            else {
		        iInts &= ~I2C_INT1;                                      // interrupt has been handled
#if defined I2C_INTERFACE
                if (I2C1STAT != I2C_IDLE_STATE) {                        // if a state generating an interrupt
                    if (VICIntEnable & INTERRUPT_I2C1) {                 // if the interrupt is defined
                        void (*interrupt_call)(void);
    #ifdef _LPC21XX
                        interrupt_call = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_I2C1);
    #else
                        interrupt_call = (void (*)(void))VICVectAddr19;
    #endif
                        interrupt_call();                                // call interrupt handler
                    }
                }
#endif
            }
        }
	}

    if ((iInts & I2C_INT2) && (argv)) {
        ptrCnt = (int *)argv[THROUGHPUT_I2C2];
        if (*ptrCnt) {
            if (--(*ptrCnt) == 0) {
                iMasks |= I2C_INT2;                                      // enough I2C interupts handled in this tick period
            }
            else {
		        iInts &= ~I2C_INT2;                                      // interrupt has been handled
#if defined I2C_INTERFACE
                if (I2C2STAT != I2C_IDLE_STATE) {                        // if a state generating an interrupt
                    if (VICIntEnable & INTERRUPT_I2C2) {                 // if the interrupt is defined
                        void (*interrupt_call)(void);
                        interrupt_call = (void (*)(void))VICVectAddr30;
                        interrupt_call();                                // call interrupt handler
                    }
                }
#endif
            }
        }
	}

#ifdef USB_INTERFACE                                                     // {14}
    if (iInts & USB_INT) {
        int iEndpoint = 0;
        iInts &= ~USB_INT;
        while ((iEndpoint < NUMBER_OF_USB_ENDPOINTS) && (ulEndpointInt != 0)) {
            if (ulEndpointInt & (1 << iEndpoint)) {
                ulEndpointInt &= ~(1 << iEndpoint);
                fnCheckUSBOut(0, iEndpoint);
            }
            iEndpoint++;
        }
    }
#endif
    return ulNewActions;
}

extern void fnSimulateI2C(int iPort, unsigned char *ptrDebugIn, unsigned short usLen, int iRepeatedStart)
{
    _EXCEPTION("TO DO!!");
}

extern void fnSimulateModemChange(int iPort, unsigned long ulNewState, unsigned long ulOldState)
{
// Note that the modem status bits are according to the MS specifications as passed by GetCommModemStatus().
// To avoid including MS headers, the bits are defined here - it is not expected that they will ever change...
#define MS_CTS_ON  0x0010
#define MS_DSR_ON  0x0020
#define MS_RING_ON 0x0040
#define MS_RLSD_ON 0x0080                                                // carrier detect
#ifdef SUPPORT_HW_FLOW
    unsigned long ulChange = (ulNewState ^ ulOldState);
    switch (iPort) {
    case 0:
    #ifdef CTS_0_PIN
        if (ulChange & MS_CTS_ON) {                                      // CTS change - set the state in the corresponding register and generate interrupt, if enabled
            unsigned long ulPortBit = CTS_0_PIN;
            unsigned char ucInput = 31;
            while (!(ulPortBit & 0x01)) {
                ucInput--;
                ulPortBit >>= 1;
            }
            if (ulNewState & MS_CTS_ON) {                                // CTS has just been activated
                fnSimulateInputChange(CTS_0_PORT, ucInput, CLEAR_INPUT);
            }
            else {                                                       // CTS has just been deactivated
                fnSimulateInputChange(CTS_0_PORT, ucInput, SET_INPUT);
            }
        }
    #endif
        break;
    case 1:
    #ifdef CTS_1_PIN
        if (ulChange & MS_CTS_ON) {                                      // CTS change - set the state in the corresponding register and generate interrupt, if enabled
            unsigned char ucPortBit = CTS_1_PIN;
            unsigned char ucInput = 7;
            while (!(ucPortBit & 0x01)) {
                ucInput--;
                ucPortBit >>= 1;
            }
            if (ulNewState & MS_CTS_ON) {                                // CTS has just been activated
                fnSimulateInputChange(CTS_1_PORT, ucInput, CLEAR_INPUT);
            }
            else {                                                       // CTS has just been deactivated
                fnSimulateInputChange(CTS_1_PORT, ucInput, SET_INPUT);
            }
        }
        break;
    #endif
    #ifdef CTS_2_PIN
    case 2:
        if (ulChange & MS_CTS_ON) {                                      // CTS change - set the state in the corresponding register and generate interrupt, if enabled
            unsigned char ucPortBit = CTS_2_PIN;
            unsigned char ucInput = 7;
            while (!(ucPortBit & 0x01)) {
                ucInput--;
                ucPortBit >>= 1;
            }
            if (ulNewState & MS_CTS_ON) {                                // CTS has just been activated
                fnSimulateInputChange(CTS_2_PORT, ucInput, CLEAR_INPUT);
            }
            else {                                                       // CTS has just been deactivated
                fnSimulateInputChange(CTS_2_PORT, ucInput, SET_INPUT);
            }
        }
        break;
    #endif
    #ifdef CTS_3_PIN
    case 3:
        if (ulChange & MS_CTS_ON) {                                      // CTS change - set the state in the corresponding register and generate interrupt, if enabled
            unsigned char ucPortBit = CTS_3_PIN;
            unsigned char ucInput = 7;
            while (!(ucPortBit & 0x01)) {
                ucInput--;
                ucPortBit >>= 1;
            }
            if (ulNewState & MS_CTS_ON) {                                // CTS has just been activated
                fnSimulateInputChange(CTS_3_PORT, ucInput, CLEAR_INPUT);
            }
            else {                                                       // CTS has just been deactivated
                fnSimulateInputChange(CTS_3_PORT, ucInput, SET_INPUT);
            }
        }
        break;
    #endif
    }
#endif
}

// UART Break detection simulation
//
extern void fnSimulateBreak(int iPort)
{
}

