sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
// Process simulated DMA
//
extern unsigned long fnSimDMA(char *argv[])
{
    return 0;
}


extern void fnSimulateLinkUp(void)
{
#ifdef ETH_INTERFACE
    #ifdef PHY_INTERRUPT
    unsigned char ucBit = 31;
    unsigned long ulBit = PHY_INT_PIN;
    while (ulBit > 1) {
        ulBit >>= 1;
        ucBit--;
    }
    fnSimulateInputChange(PHY_INT_PORT, ucBit, CLEAR_INPUT);
    #endif
    fnUpdateIPConfig();                                                  // update display in simulator
#endif
}

#ifdef SUPPORT_RTC                                                       // {4}
// Synchronise the internal RTC to the PC time when simulating
//
extern void fnInitInternalRTC(char *argv[])
{
    unsigned short *ptrShort = (unsigned short *)*argv;

    RTC_YEAR = *ptrShort++;
    RTC_MONTH = *ptrShort++;
    RTC_DOW = *ptrShort++;
    RTC_DOM = *ptrShort++;
    RTC_HOUR = *ptrShort++;
    RTC_MIN = *ptrShort++;
    RTC_SEC = *ptrShort++;
    RTC_DOY = ((RTC_MONTH * 30) + RTC_DOM);                              // approximate day of year

    RTC_CTIME0 = (RTC_SEC | (RTC_MIN << 8) | (RTC_HOUR << 16) | (RTC_DOW << 24));
    RTC_CTIME1 = (RTC_DOM | (RTC_MONTH << 8) | (RTC_YEAR << 16));
    RTC_CTIME2 = RTC_DOY;

    RTC_CCR = (CCR_CLKSRC_32K | CCR_CLKEN);                              // enable the RTC (this assumes that it was previously enabled before last power down and running from 32kHz clock, which is the general case)
}
#endif


// We can simulate timers during a tick here if required
//
extern int fnSimTimers(void)
{
    // Timer 0..3 simulation. These assume no prescaler and only match on internal match channel 0
    //
    if (T0TCR & COUNTER_ENABLE) {                                        // ensure enabled
#if defined LPC2101 || defined LPC2102 || defined LPC2103
        if (!(PWM0CON & (PWM_MAT0_ENABLE | PWM_MAT1_ENABLE | PWM_MAT2_ENABLE | PWM_MAT3_ENABLE))) { // ignore if in PWM mode
#endif
        unsigned long ulTickCount = 0;
        switch (PCLKSEL0 & PCLK_TIMER0_CCLK_8) {
        case PCLK_TIMER0_CCLK_1:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(1*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER0_CCLK_2:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(2*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER0_CCLK_4:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(4*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER0_CCLK_8:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(8*1000000)); // clock pulses in tick period
            break;
        }
        if (T0PR != 0) {                                                 // {16}
            ulTickCount /= (T0PR + 1);
        }
        if ((T0TC + ulTickCount) >= T0MR0) {                             // match with register 0
            if (T0MCR & MR0R) {                                          // reset on match
                T0TC = 0;
            }
            else {                                                       // {16}
                T0TC += ulTickCount;
            }
            if (T0MCR & MR0S) {                                          // stop on match
                T0TCR = 0;
            }
            if (VICIntEnable & INTERRUPT_TIMER0) {                       // ensure interrupt enabled
#ifdef _LPC21XX
                void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_TIMER0);
#else
                void (*interrupt_call)(void) = (void (*)(void))VICVectAddr4;
#endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        else {
            T0TC += ulTickCount;
        }
#if defined LPC2101 || defined LPC2102 || defined LPC2103
        }
#endif
    }

    if (T1TCR & COUNTER_ENABLE) {                                        // ensure enabled
#if defined LPC2101 || defined LPC2102 || defined LPC2103
        if (!(PWM1CON & (PWM_MAT0_ENABLE | PWM_MAT1_ENABLE | PWM_MAT2_ENABLE | PWM_MAT3_ENABLE))) { // ignore if in PWM mode
#endif
        unsigned long ulTickCount = 0;
        switch (PCLKSEL0 & PCLK_TIMER1_CCLK_8) {
        case PCLK_TIMER1_CCLK_1:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(1*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER1_CCLK_2:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(2*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER1_CCLK_4:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(4*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER1_CCLK_8:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(8*1000000)); // clock pulses in tick period
            break;
        }
        if (T1PR != 0) {                                                 // {16}
            ulTickCount /= (T1PR + 1);
        }
        if ((T1TC + ulTickCount) >= T1MR0) {                             // match with register 0
            if (T1MCR & MR0R) {                                          // reset on match
                T1TC = 0;
            }
            else {                                                       // {16}
                T1TC += ulTickCount;
            }
            if (T1MCR & MR0S) {                                          // stop on match
                T1TCR = 0;
            }
            if (VICIntEnable & INTERRUPT_TIMER1) {                       // ensure interrupt enabled
#ifdef _LPC21XX
                void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_TIMER1);
#else
                void (*interrupt_call)(void) = (void (*)(void))VICVectAddr5;
#endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        else {                                                           // {9}
            T1TC += ulTickCount;
        }
#if defined LPC2101 || defined LPC2102 || defined LPC2103
        }
#endif
    }

#if TIMERS_AVAILABLE > 2                                                 // {12} LPC2148 has only timers 0 and 1
    if (T2TCR & COUNTER_ENABLE) {                                        // ensure enabled
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
        if (!(PWM2CON & (PWM_MAT0_ENABLE | PWM_MAT1_ENABLE | PWM_MAT2_ENABLE | PWM_MAT3_ENABLE))) { // ignore if in PWM mode
    #endif
        unsigned long ulTickCount = 0;
        switch (PCLKSEL1 & PCLK_TIMER2_CCLK_8) {
        case PCLK_TIMER2_CCLK_1:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(1*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER2_CCLK_2:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(2*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER2_CCLK_4:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(4*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER2_CCLK_8:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(8*1000000)); // clock pulses in tick period
            break;
        }
        if (T2PR != 0) {                                                 // {16}
            ulTickCount /= (T2PR + 1);
        }
        if ((T2TC + ulTickCount) >= T2MR0) {                             // match with register 0
            if (T2MCR & MR0R) {                                          // reset on match
                T2TC = 0;
            }
            else {
                T2TC += ulTickCount;                                     // {16}
            }
            if (T2MCR & MR0S) {                                          // stop on match
                T2TCR = 0;
            }
            if (VICIntEnable & INTERRUPT_TIMER2) {                       // ensure interrupt enabled
    #ifdef _LPC21XX
                void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_TIMER2);
    #else
                void (*interrupt_call)(void) = (void (*)(void))VICVectAddr26;
    #endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        else {                                                           // {9}
            T2TC += ulTickCount;
        }
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
        }
    #endif
    }

    if (T3TCR & COUNTER_ENABLE) {                                        // ensure enabled
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
        if (!(PWM3CON & (PWM_MAT0_ENABLE | PWM_MAT1_ENABLE | PWM_MAT2_ENABLE | PWM_MAT3_ENABLE))) { // ignore if in PWM mode
    #endif
        unsigned long ulTickCount = 0;
        switch (PCLKSEL1 & PCLK_TIMER2_CCLK_8) {
        case PCLK_TIMER3_CCLK_1:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(1*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER3_CCLK_2:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(2*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER3_CCLK_4:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(4*1000000)); // clock pulses in tick period
            break;
        case PCLK_TIMER3_CCLK_8:
            ulTickCount = (unsigned long)((float)((float)TICK_RESOLUTION*(float)PCLK)/(float)(8*1000000)); // clock pulses in tick period
            break;
        }
        if (T3PR != 0) {                                                 // {16}
            ulTickCount /= (T3PR + 1);
        }
        if ((T3TC + ulTickCount) >= T3MR0) {                             // match with register 0
            if (T3MCR & MR0R) {                                          // reset on match
                T3TC = 0;
            }
            else {                                                       // {16}
                T3TC += ulTickCount;
            }
            if (T3MCR & MR0S) {                                          // stop on match
                T3TCR = 0;
            }
            if (VICIntEnable & INTERRUPT_TIMER3) {                       // ensure interrupt enabled
    #ifdef _LPC21XX
                void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_TIMER3);
    #else
                void (*interrupt_call)(void) = (void (*)(void))VICVectAddr27;
    #endif
                interrupt_call();                                        // call interrupt handler
            }
        }
        else {                                                           // {9}
            T3TC += ulTickCount;
        }
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
        }
    #endif
    }
#endif
    if (WDMOD & WDEN) {
        if (WDFEED == 0x55) {                                            // recognised as retrigger
            WDTV = WDTC;                                                 // reload watchdog counter since retriggered
            WDFEED = 0x12345678;
        }
        else {
            unsigned long ulTickCount;
            switch (WDCLKSEL) {
            case WD_CLOCK_INT_RC:                                        // not supported
            case WD_CLOCK_RTC:
                WDTV = 0;
                break;
            case WD_CLOCK_PCLK:
                switch (PCLKSEL0 & PCLK_WDT_CCLK_8) {
                    case PCLK_WDT_CCLK_1:
                        ulTickCount = ((PCLK/1000000)*TICK_RESOLUTION);
                        break;
                    case PCLK_WDT_CCLK_2:
                        ulTickCount = ((PCLK/2000000)*TICK_RESOLUTION);
                        break;
                    case PCLK_WDT_CCLK_4:
                        ulTickCount = ((PCLK/4000000)*TICK_RESOLUTION);
                        break;
                    case PCLK_WDT_CCLK_8:
                        ulTickCount = ((PCLK/8000000)*TICK_RESOLUTION);
                        break;
                }
                if (WDTV >= ulTickCount) {
                    WDTV -= ulTickCount;
                }
                else {
                    WDTV = 0;
                }
                break;
            }
            if (WDTV == 0) {
                if (WDRESET & WDMOD) {                                   // programmed to generate reset on timeout
                    return RESET_CARD_WATCHDOG;                          // signal watchdog reset
                }
            }
        }
    }
#ifdef SUPPORT_RTC                                                       // {4}
    if (RTC_CCR & CCR_CLKEN) {                                           // if RTC is enabled
        if (RTC_CCR & CCR_CLKSRC_32K) {                                  // if clocked from 32kHz
            RTC_CTC += (32768/(1000000/TICK_RESOLUTION));                // the count per TICK based on 32kHz source
        }
        else {
            RTC_CTC += ((PCLK/(RTC_PREINT + 1))/(1000000/TICK_RESOLUTION)); // the count per TICK
        }
        if (RTC_CTC >= 32768) {                                          // one second count
            RTC_CTC = 0;
            (RTC_SEC)++;
            if (RTC_CIIR & CIIR_IMSEC) {                                 // interrupt on each second increment
                RTC_ILR |= RTCCIF;                                       // set the increment interrupt flag
            }
            if (RTC_SEC >= 60) {
                RTC_SEC = 0;
                (RTC_MIN)++;
                if (RTC_CIIR & CIIR_IMMIN) {                             // interrupt on each minute increment
                    RTC_ILR |= RTCCIF;                                   // set the increment interrupt flag
                }
                if (RTC_MIN >= 60) {
                    RTC_MIN = 0;
                    (RTC_HOUR)++;
                    if (RTC_CIIR & CIIR_IMHOUR) {                        // interrupt on each hour increment
                        RTC_ILR |= RTCCIF;                               // set the increment interrupt flag
                    }
                    if (RTC_HOUR >= 24) {
                        RTC_HOUR = 0;
                        (RTC_DOW)++;
                        if (RTC_CIIR & (CIIR_IMDOW | CIIR_IMDOW | CIIR_IMDOY)) { // interrupt on each day of week, month or year increment
                            RTC_ILR |= RTCCIF;                           // set the increment interrupt flag
                        }
                        if (RTC_DOW >= 7) {
                            RTC_DOW = 0;
                        }
                        (RTC_DOY)++;
                        (RTC_DOM)++;
                        if (RTC_DOM >= 30) {                             // approximate
                            RTC_DOM = 0;
                            (RTC_MONTH)++;
                            if (RTC_CIIR & CIIR_IMMON) {                 // interrupt on each month increment
                                RTC_ILR |= RTCCIF;                       // set the increment interrupt flag
                            }
                            if (RTC_MONTH >= 12) {
                                RTC_MONTH = 0;
                                (RTC_YEAR)++;
                                if (RTC_CIIR & CIIR_IMYEAR) {             // interrupt on each year increment
                                    RTC_ILR |= RTCCIF;                   // set the increment interrupt flag
                                }
                            }
                        }
                    }
                }
            }
            RTC_CTIME0 = (RTC_SEC | (RTC_MIN << 13) | (RTC_HOUR << 20) | (RTC_DOW << 26));
            RTC_CTIME1 = (RTC_DOM | (RTC_MONTH << 11) | (RTC_YEAR << 27));
            RTC_CTIME2 = RTC_DOY;

