sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
// Handle data sent by USB                                         
//
extern void fnSimUSB(int iType, int iEndpoint, USB_HW *ptrUSB_HW)
{
    extern void fnChangeUSBState(int iNewState);
    switch (iType) {
    case USB_SIM_RESET:
        {
            int x;
            ucUSB_address = DEV_EN;
            fnChangeUSBState(0);
            for (x = 0; x < NUMBER_OF_USB_ENDPOINTS; x++) {
                fnLogUSB(x, 0, (unsigned char *)0xffffffff, 0);          // log reset on each endpoint
            }
        }
        break;
    case USB_SIM_TX:                                                     // a frame transmission has just been started
//        if (((TXPKTRDY | EPEDS) & *ptrUSB_HW->ptr_ulUSB_BDControl) != (TXPKTRDY | EPEDS)) { // if the ownership has not been passed to the USB controller ignore it
//          return;
//      }
        iInts |= USB_INT;                                                // flag that the interrupt should be handled
        ulEndpointInt |= (1 << iEndpoint);                               // flag endpoint
        break;
    case USB_SIM_ENUMERATED:                                             // flag that we have completed emumeration
        fnChangeUSBState(1);
        break;
    case USB_SIM_STALL:
        fnLogUSB(iEndpoint, 1, (unsigned char *)0xffffffff, 0);          // log stall
        break;
    case USB_SIM_SUSPEND:
        fnChangeUSBState(0);
        break;
    }
}

static unsigned char ucEndpointFifoIn0[64];                               // LPC endpoint rx FIFOs - control
static unsigned char ucEndpointFifoIn1[64];                               // isochronous
static unsigned char ucEndpointFifoIn2[2][64];                            // bulk - double buffered
static unsigned char ucEndpointFifoIn3[2][1023];                          // isochronous - double buffered
static unsigned char ucEndpointFifoIn4[64];                               // interrupt
static unsigned char ucEndpointFifoIn5[2][64];                            // bulk - double buffered
static unsigned char ucEndpointFifoIn6[2][1023];                          // isochronous - double buffered
static unsigned char ucEndpointFifoIn7[64];                               // interrupt
static unsigned char ucEndpointFifoIn8[2][64];                            // bulk - double buffered
static unsigned char ucEndpointFifoIn9[9][1023];                          // isochronous - double buffered
static unsigned char ucEndpointFifoIn10[64];                              // interrupt
static unsigned char ucEndpointFifoIn11[2][64];                           // bulk - double buffered
static unsigned char ucEndpointFifoIn12[9][1023];                         // isochronous - double buffered
static unsigned char ucEndpointFifoIn13[64];                              // interrupt
static unsigned char ucEndpointFifoIn14[2][64];                           // bulk - double buffered
static unsigned char ucEndpointFifoIn15[2][64];                           // bulk - double buffered

static unsigned short usEndpoint_in_index[16] = {0};
static unsigned char ucEndpoint_in_buffer_put[16] = {0};
static unsigned char ucEndpoint_in_buffer_get[16] = {0};
static unsigned long ulEndpoint_in_valid[16] = {0};

static unsigned char ucEndpointFifoOut0[64];                             // LPC endpoint rx FIFOs - control
static unsigned char ucEndpointFifoOut1[64];                             // isochronous
static unsigned char ucEndpointFifoOut2[2][64];                          // bulk - double buffered
static unsigned char ucEndpointFifoOut3[2][1023];                        // isochronous - double buffered
static unsigned char ucEndpointFifoOut4[64];                             // interrupt
static unsigned char ucEndpointFifoOut5[2][64];                          // bulk - double buffered
static unsigned char ucEndpointFifoOut6[2][1023];                        // isochronous - double buffered
static unsigned char ucEndpointFifoOut7[64];                             // interrupt
static unsigned char ucEndpointFifoOut8[2][64];                          // bulk - double buffered
static unsigned char ucEndpointFifoOut9[2][1023];                        // isochronous - double buffered
static unsigned char ucEndpointFifoOut10[64];                            // interrupt
static unsigned char ucEndpointFifoOut11[2][64];                         // bulk - double buffered
static unsigned char ucEndpointFifoOut12[2][1023];                       // isochronous - double buffered
static unsigned char ucEndpointFifoOut13[64];                            // interrupt
static unsigned char ucEndpointFifoOut14[2][64];                         // bulk - double buffered
static unsigned char ucEndpointFifoOut15[2][64];                         // bulk - double buffered

static int iEndpointProperties[16] = {                                   // double-buffered property
    0, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1
};

static unsigned long endpoint_enabled = 0;

static unsigned char ucDeviceStatus = 0;
static unsigned char ucEndpointStatus[2*16] = {0};


extern void fnCheckUSBOut(int iDevice, int iEndpoint)
{
    extern int iGetGetBank(int iEndpoint);

    int iBank = 0;
    switch (iEndpoint) {
    case 0:                                                              // endpoint 0
        while (ulEndpoint_in_valid[0]) {                                 // IN buffer valid
            unsigned short usUSBLength;
            usUSBLength = (unsigned short)ulEndpoint_in_valid[0];        // extract the length of data content
            ulEndpoint_in_valid[0] = 0;
            iTxDataToggle[0] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(0, usUSBLength, ucEndpointFifoOut0, iTxDataToggle[0]);
            USBEpIntSt  |= 0x00000002;                                   // mark that this endpoint has a pending interrupt
            if (USBEpIntSt & 0x00000002) {                               // if the interrupt is enabled set the device interrupt state
                if (USBEpIntPri & 0x00000002) {
                    USBDevIntSt |= DEVICE_STATUS_EP_FAST;
                }
                else {
                    USBDevIntSt |= DEVICE_STATUS_EP_SLOW;
                }
            }
            ucEndpointStatus[1] &= ~(USB_EP_BUFFER_1_FULL | USB_EP_FULL_EMPTY); // tx buffer free
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt            
        }
        /*if (UDP_CSR0 & FORCESTALL) {
            UDP_CSR0 |= STALLSENT;                                       // stall acknowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }*/
        break;
/*
    case 1:                                                              // endpoint 1
        if (!(UDP_CSR1 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR1 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(1);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut1[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[1] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(1, usUSBLength, &ucEndpointFifoOut1[iBank][2], iTxDataToggle[1]);
            if (UDP_IMR & EP1INT) {
                UDP_ISR |= EP1INT;
            }
            UDP_CSR1 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR1 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt
        }
        if (UDP_CSR1 & FORCESTALL) {
            UDP_CSR1 |= STALLSENT;                                       // stall acknowledged
            UDP_ISR = EP1INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }
        break;
    case 2:                                                              // endpoint 2
        if (!(UDP_CSR2 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR2 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(2);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut2[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[2] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(2, usUSBLength, &ucEndpointFifoOut2[iBank][2], iTxDataToggle[2]);
            if (UDP_IMR & EP2INT) {
                UDP_ISR |= EP2INT;
            }
            UDP_CSR2 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR2 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt
        }
        if (UDP_CSR2 & FORCESTALL) {
            UDP_CSR2 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP2INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }
        break;
    case 3:                                                              // endpoint 3
        if (!(UDP_CSR3 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR3 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut3, sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[3] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(3, usUSBLength, &ucEndpointFifoOut3[2], iTxDataToggle[3]);
            if (UDP_IMR & EP3INT) {
                UDP_ISR |= EP3INT;
            }
            UDP_CSR3 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR3 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt
        }
        if (UDP_CSR3 & FORCESTALL) {
            UDP_CSR3 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }
        break;
    case 4:                                                              // endpoint 4
        if (!(UDP_CSR4 & EPEDS)) {
            return;                                                      // endpoint not enabled so ignore
        }
        while (UDP_CSR4 & TXPKTRDY) {                                    // transmission bit set
            unsigned short usUSBLength;
            iBank = iGetGetBank(4);
            memcpy((unsigned char *)&usUSBLength, ucEndpointFifoOut4[iBank], sizeof(unsigned short)); // extract the length of data content
            iTxDataToggle[4] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(4, usUSBLength, &ucEndpointFifoOut4[iBank][2], iTxDataToggle[4]);
            if (UDP_IMR & EP4INT) {
                UDP_ISR |= EP4INT;
            }
            UDP_CSR4 &= ~TXPKTRDY;                                       // transmission complete
            UDP_CSR4 |= TXCOMP;                                          // mark that the transmission has been successfully acknowledged            
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt
        }
        if (UDP_CSR4 & FORCESTALL) {
            UDP_CSR4 |= STALLSENT;                                       // stall acnowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }
        break;*/
    case 5:                                                              // endpoint 5
        while (ulEndpoint_in_valid[5]) {                                 // IN buffer valid
            unsigned short usUSBLength;
            usUSBLength = (unsigned short)ulEndpoint_in_valid[5];        // extract the length of data content
            ulEndpoint_in_valid[5] = 0;
            iTxDataToggle[5] ^= 1;                                       // automatic data toggle on transmission since it is automatically controlled by the chip
            fnLogUSB(5, usUSBLength, ucEndpointFifoOut5[0], iTxDataToggle[5]);
            USBEpIntSt  |= 0x00000800;                                   // mark that this endpoint has a pending interrupt
            if (USBEpIntSt & 0x00000800) {                               // if the interrupt is enabled set the device interrupt state
                if (USBEpIntPri & 0x00000800) {
                    USBDevIntSt |= DEVICE_STATUS_EP_FAST;
                }
                else {
                    USBDevIntSt |= DEVICE_STATUS_EP_SLOW;
                }
            }
            ucEndpointStatus[11] &= ~(USB_EP_BUFFER_1_FULL | USB_EP_FULL_EMPTY); // tx buffer free
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_IN_SUCCESS);     // generate tx interrupt            
        }
        /*if (UDP_CSR0 & FORCESTALL) {
            UDP_CSR0 |= STALLSENT;                                       // stall acknowledged
            UDP_ISR = EP0INT;
            fnSimulateUSB(iDevice, iEndpoint, 0, 0, USB_STALL_SUCCESS);  // generate stall interrupt
        }*/
        break;
    }
}



extern unsigned long fnUSB_command_interpreter(unsigned long ulCommand, unsigned long ulData)
{
    switch (ulCommand) {
    case USB_CMD_GET_DEVICE_STATUS:
        if (USB_CMD_GET_DEVICE_STATUS_DATA_PHASE == ulData) {
            return ucDeviceStatus;
        }
        break;
    default:
        if ((ulCommand & ~0x00ff0000) == USB_CMD_SELECT_EP) {
            unsigned char ucEndpoint = (unsigned char)((ulCommand & 0x00ff0000) >> 16);
            if ((ulData & ~0x00ff0000) == USB_CMD_SELECT_EP_DATA_PHASE) {
                if ((unsigned char)((ulData & 0x00ff0000) >> 16) == ucEndpoint) {
                    return ucEndpointStatus[ucEndpoint];
                }
            }
        }
        break;
    }
    return 0;
}


extern unsigned long fnUSB_command_command(unsigned long ulCommand, unsigned long ulData)
{
    static unsigned char ucEndpoint = 0;
    switch (ulCommand) {
    case USB_CMD_SET_DEVICE_STATUS:
        break;
    case USB_CMD_SET_ADDRESS:
        if (USB_CMD_SET_ADDRESS_DATA_PHASE == (ulData & ~0x00ff0000)) {
            ucUSB_address = (unsigned char)(ulData >> 16);
        }
        break;
    case USB_CMD_VALID_EP_BUFFER:                                        // validates that the IN buffer corresponding to the presently selected endpoint is reads to be dispatched
        ulEndpoint_in_valid[ucEndpoint/2] = (USBTxPLen | 0x80000000);    // mark that data is ready and set its length
        if (ucEndpoint <= 1) {
            ucEndpointStatus[ucEndpoint] |= (USB_EP_BUFFER_1_FULL | USB_EP_FULL_EMPTY); // mark that buffer 1 is full and also set the full flag
        }
        else {
            ucEndpointStatus[ucEndpoint] |= (USB_EP_BUFFER_1_FULL | USB_EP_FULL_EMPTY); // mark that buffer 1 is full and also set the full flag
        }
        break;
    default:
        if ((ulCommand & ~0x00ff0000) == USB_CMD_SELECT_EP) {
            ucEndpoint = (unsigned char)((ulCommand & 0x00ff0000) >> 16);// select physical enpoint index
        }
        break;
    }
    return 0;
}





