sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
static volatile unsigned char *fnGetUSB_FIFOAdd(volatile unsigned char *ptrAdd, int iDirection)
{
    /*
    if (iDirection != 0) {                                               // transmission buffer
        if (UDP_FDR0_ADD == ptrAdd) {
            return ucEndpointFifoOut0;
        }
        if (UDP_FDR1_ADD == ptrAdd) {
            return ucEndpointFifoOut1[0];
        }
        if (UDP_FDR2_ADD == ptrAdd) {
            return ucEndpointFifoOut2[0];
        }
        if (UDP_FDR3_ADD == ptrAdd) {
            return ucEndpointFifoOut3;
        }
        if (UDP_FDR4_ADD == ptrAdd) {
            return ucEndpointFifoOut4[0];
        }
        if (UDP_FDR5_ADD == ptrAdd) {
            return ucEndpointFifoOut5[0];
        }
    }
    else {
        if (UDP_FDR0_ADD == ptrAdd) {
            return ucEndpointFifoIn0;
        }
        if (UDP_FDR1_ADD == ptrAdd) {
            return ucEndpointFifoIn1[0];
        }
        if (UDP_FDR2_ADD == ptrAdd) {
            return ucEndpointFifoIn2[0];
        }
        if (UDP_FDR3_ADD == ptrAdd) {
            return ucEndpointFifoIn3;
        }
        if (UDP_FDR4_ADD == ptrAdd) {
            return ucEndpointFifoIn4[0];
        }
        if (UDP_FDR5_ADD == ptrAdd) {
            return ucEndpointFifoIn5[0];
        }
    }
    return ptrAdd;
    */
    return 0;
}

extern unsigned long fnGetUSB_from_FIFO(void)
{
    if (USBCtrl & CTRL_RD_EN) {
        unsigned char ucEndpoint = (unsigned char)((USBCtrl >> 2) & 0x0f);// logical endpoint
        unsigned long ulData;
        switch (ucEndpoint) {
        case 0:
            ulData  =  ucEndpointFifoIn0[usEndpoint_in_index[0]++];
            ulData |= (ucEndpointFifoIn0[usEndpoint_in_index[0]++] << 8);
            ulData |= (ucEndpointFifoIn0[usEndpoint_in_index[0]++] << 16);
            ulData |= (ucEndpointFifoIn0[usEndpoint_in_index[0]++] << 24);
            break;

        case 2:
            ulData  =  ucEndpointFifoIn2[ucEndpoint_in_buffer_get[2]][usEndpoint_in_index[2]++];
            ulData |= (ucEndpointFifoIn2[ucEndpoint_in_buffer_get[2]][usEndpoint_in_index[2]++] << 8);
            ulData |= (ucEndpointFifoIn2[ucEndpoint_in_buffer_get[2]][usEndpoint_in_index[2]++] << 16);
            ulData |= (ucEndpointFifoIn2[ucEndpoint_in_buffer_get[2]][usEndpoint_in_index[2]++] << 24);
            ucEndpoint_in_buffer_get[2] ^= 0x01;
            break;
        }
        return ulData;
    }
    return 0;
}

// Inject USB transactions for test purposes
//
extern int fnSimulateUSB(int iDevice, int iEndPoint, unsigned char ucPID, unsigned char *ptrDebugIn, unsigned short usLenEvent)
{
    if (ptrDebugIn == 0) {
        switch (usLenEvent) {
        case USB_RESET_CMD:
//          memset(iTxDataToggle, 0, sizeof(iTxDataToggle));
//          memset(iRxDataBank, 0, sizeof(iRxDataBank));
//          memset(ulTxDataBank, 0, sizeof(ulTxDataBank));
            USBDevIntSt |= DEVICE_STATUS_DEV_STAT;                       // flag that a USB bus reset has been detected
            ucDeviceStatus = USB_STATUS_RST;
            break;
        case USB_SLEEP_CMD:
            USBDevIntSt |= DEVICE_STATUS_DEV_STAT;                       // flag that a suspend reset has been detected
            ucDeviceStatus = (0x00000004 | 0x00000008);
            break;
        case USB_RESUME_CMD:
//          UDP_ISR = RXRSM;
            break;
        case USB_STALL_SUCCESS:
        case USB_IN_SUCCESS:
            break;
        default:
            return 0;
        }
    }
    else {                                                               // data being injected
        if (((ucUSB_address & DEV_EN) == 0) || ((ucUSB_address & ~DEV_EN) != iDevice)) { // if the USB address is either not enabled or is different to the addressed one
            if (iDevice != 0xff) {                                       // special broadcast for simulator use so that it doesn't have to know the USB address
                return 1;
            }
        }
        switch (iEndPoint) {
        case 0:                                                          // endpoint 0 - control/bulk/interrupt - max endpoint size 8 bytes - not dual-banked
            USBEpIntSt |= 0x00000001;                                    // mark that this endpoint has a pending interrupt
            if (USBEpIntEn & 0x00000001) {                               // if the interrupt is enabled set the device interrupt state
                if (USBEpIntPri & 0x00000001) {
                    USBDevIntSt |= DEVICE_STATUS_EP_FAST;
                }
                else {
                    USBDevIntSt |= DEVICE_STATUS_EP_SLOW;
                }
            }
            if (SETUP_PID == ucPID) {                                    // if a setup packet set the RXSETUP bit
                ucEndpointStatus[0] = USB_EP_SETUP_PACKET_RECEIVE;
            }
            else if (OUT_PID == ucPID) {
                ucEndpointStatus[0] = 0;
            }
            USBRxPLen = (usLenEvent | PKT_DV | PKT_RDY);                 // the reception length
            if (usLenEvent > sizeof(ucEndpointFifoIn0)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn0);
            }
            memcpy(ucEndpointFifoIn0, ptrDebugIn, usLenEvent); 
            usEndpoint_in_index[0] = 0;
            break;
        case 2:                                                          // double-buffered bulk
            USBEpIntSt |= 0x00000010;                                    // mark that this endpoint has a pending interrupt (or DMA request)
            if (USBEpIntEn & 0x00000010) {                               // if the interrupt is enabled set the device interrupt state
                if (USBEpIntPri & 0x00000010) {
                    USBDevIntSt |= DEVICE_STATUS_EP_FAST;
                }
                else {
                    USBDevIntSt |= DEVICE_STATUS_EP_SLOW;
                }
            }
            ucEndpointStatus[2] = 0;
            USBRxPLen = (usLenEvent | PKT_DV | PKT_RDY);                 // the reception length
            if (usLenEvent > sizeof(ucEndpointFifoIn2)) {                // limit data length to the FIFO length
                usLenEvent = sizeof(ucEndpointFifoIn2);
            }
            memcpy(ucEndpointFifoIn2[ucEndpoint_in_buffer_put[2]], ptrDebugIn, usLenEvent); 
            usEndpoint_in_index[2] = 0;
            ucEndpoint_in_buffer_put[2] ^= 0x01;
            break;
        }
    }
    if (USBDevIntSt & USBDevIntEn) {                    
    #ifdef _LPC21XX
        void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_USB);
    #else
        void (*interrupt_call)(void) = (void (*)(void))VICVectAddr22;
    #endif
        interrupt_call();                                                // call interrupt handler
    }
#if (defined USB_DMA_RX || defined USB_DMA_TX) && defined USB_RAM_SIZE
    else if (USBEpIntSt & USBEpDMASt) {                                  // DMA enabled on endpoint
        extern unsigned char *fnGetUSB_mem(void);
        unsigned short usFrameSize;
        unsigned short usBufferSize;
        unsigned long *ptrUSB_mem = (unsigned long *)fnGetUSB_mem();
        DMA_DESCRIPTOR_ISO *buffer_descriptor;
        ptrUSB_mem += (2 * iEndPoint);                                   // first buffer descriptor belonging to this endpoint
        buffer_descriptor = (DMA_DESCRIPTOR_ISO *)*ptrUSB_mem;
        usFrameSize = (unsigned short)((MAX_PACKET_SIZE_MASK & buffer_descriptor->dma_mode_status) >> 5);
        usBufferSize = (unsigned short)(buffer_descriptor->dma_mode_status >> 16);
        if (usFrameSize < usLenEvent) {                                  // copy FIFO content to USB memory
            uMemcpy((unsigned char *)buffer_descriptor->buffer_start_address, ptrDebugIn, usFrameSize);
            buffer_descriptor->buffer_start_address += usFrameSize;
            buffer_descriptor->dd_mode_status = (DD_RETIRED | DD_STATUS_DATA_UNDERRUN_SHORT | DD_PACKET_VALID | ((usFrameSize << 8) & DD_MESSAGE_LENGTH_POS_MASK) | (usFrameSize << 16));
        }
        else {
            uMemcpy((unsigned char *)buffer_descriptor->buffer_start_address, ptrDebugIn, usLenEvent);
            buffer_descriptor->buffer_start_address += usLenEvent;
            buffer_descriptor->dd_mode_status = (DD_RETIRED | DD_STATUS_DATA_UNDERRUN_SHORT | DD_PACKET_VALID | (usLenEvent << 16));
        }
        USBDMAIntSt |= USB_DMA_EOT;
        if (USBDMAIntEn & USB_DMA_EOT) {                                 // if interrupt enabled on DMA descriptor completion
    #ifdef _LPC21XX
            void (*interrupt_call)(void) = (void (*)(void))fnGetVectoredIntSlot(INTERRUPT_USB);
    #else
            void (*interrupt_call)(void) = (void (*)(void))VICVectAddr22;
    #endif
            USBIntSt |= USB_INT_REQ_DMA;
            USBEoTIntSt |= (0x00000001 << (iEndPoint * 2));
            USBEpIntSt &= ~(0x00000001 << (iEndPoint * 2));
            interrupt_call();                                            // call interrupt handler
        }
        
