sWahlinRhoades/uTaskerModified/Hardware/LPC2XXX/LPC23XXSim.c
    }
#endif
    return 0;
}
#endif

#ifdef BATTERY_BACKED_RAM                                                // {7}
// Return all RTC content which is battery backed up
//
extern int fnGetBatteryRAMContent(unsigned char *ucData, unsigned long ulReference)
{
#ifdef _LPC21XX
    unsigned char *ptrData = (RTC_BLOCK + ulReference);
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
    if (ulReference < 0x80) {                                            // save the RTC content
        ptrData = (RTC_BLOCK + ulReference);
        *ucData = *ptrData;
        return 1;
    }
    #else
    #endif
#endif
    return 0;                                                            // all data saved
}
extern int fnPutBatteryRAMContent(unsigned char ucData, unsigned long ulReference)
{
#ifdef _LPC21XX
    unsigned char *ptrData = (RTC_BLOCK + ulReference);
    #if defined LPC2101 || defined LPC2102 || defined LPC2103
    if (ulReference < 0x80) {                                            // save the RTC content
        ptrData = (RTC_BLOCK + ulReference);
        if ((ulReference < 0x14) || (ulReference >= 0x40)) {             // don't overwrite time which has been taken from the local PC
            *ptrData = ucData;
        }
        return 1;
    }
    #else
    #endif
#endif
    return 0;                                                            // no more data accepted
}
#endif


#ifdef SUPPORT_TOUCH_SCREEN
static int iPenLocationX = 0;                                            // last sample ADC input value
static int iPenLocationY = 0;
static int iPenDown = 0;

#define MIN_X_TOUCH          0x2000                                      // reference values for 4-wire touch on LPC2478-STK
#define MAX_X_TOUCH          0xe800
#define MIN_Y_TOUCH          0x2900
#define MAX_Y_TOUCH          0xe000

extern void fnPenPressed(int iX, int iY, int iPenRef)
{
    iPenLocationX = (iX - 6);
    iPenLocationY = (iY - 3);
    iPenDown = 1;
}

extern void fnPenMoved(int iX, int iY, int iPenRef)
{
    iPenLocationX = (iX - 6);
    iPenLocationY = (iY - 3);
}

extern void fnPenLifted(int iPenRef)
{
    iPenLocationX = 0;
    iPenLocationY = 0;
    iPenDown = 0;
}

extern void fnGetPenSamples(unsigned short *ptrX, unsigned short *ptrY)
{
    if (iPenLocationX != 0) {
        iPenLocationX = iPenLocationX;
    }
    if (iPenDown == 0) {
        *ptrX = 0;
        *ptrY = 0;
    }
    else {
        *ptrX = (MIN_X_TOUCH + ((iPenLocationX * ((MAX_X_TOUCH - MIN_X_TOUCH)))/GLCD_X));
        *ptrY = (MIN_Y_TOUCH + ((iPenLocationY * ((MAX_Y_TOUCH - MIN_Y_TOUCH)))/GLCD_Y));
    }
}
#endif
#endif
